# ZCenter

## Description
<b>[[VS:Vectorworks 2012 Deprecated Functions|DEPRECATED after Vectorworks2012]]</b>. See [[VS:ZCenterN|ZCenterN]] for a replacement function.

Returns the z-coordinate value of the center of an object matching the search criteria.

```pascal
FUNCTION ZCenter(c : CRITERIA): REAL;
```

```python
def vs.ZCenter(c):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|   |

## Version
Availability: from Vectorworks14.0
Deprecated: [[VS:Vectorworks 2012 Deprecated Functions|Vectorworks 2012]]

## Category
* Criteria